#ifndef __GAME_H__
#define __GAME_H__


// インクルード==================
#include <stdio.h>
#include "CScreen.h"
//===============================



// 定義============================================================

//==================================================================


// 構造体===============================
//=======================================


// プロトタイプ宣言==============
void GameUpdate( void );
void GameDraw( void );
void GameInitScene( void );
void GameUnInitScene( void );
//===============================


#endif